	          //电话号码验证
	          var phoneNum=/^1[0-9]{10}/; 
	         //动态密码验证
	          var DTMMNum=/^1[0-9]{5}/;
	         //邮箱验证 
	          var address=/[a-zA-Z0-9]{1,10}@[a-zA-Z0-9]{1,5}\.[a-zA-Z0-9]{1,5}/;
	         //用户名验证
	          var usrname=/^[a-zA-Z][a-zA-Z0-9]*$/  ;	
             //检测密码
	          var mymm=/^[a-zA-Z0-9]{6,30}$/; 
	         //检测银行卡
	          var yh=/^6[0-9]{18}/;
	 
			var cnVal=new Array();
			   cnVal['11']=['AP0001287'];
			   cnVal['12']=['ICBCLMXYK','GD-BANK','GFBANK','AP0000816','AP0009523',
			                'CCB-VIP','BOC-SHA','CCBCC','JHSL','MSXYK','NBBANK','AP0009563',
			                'PINGANYH','PFXYK','AP0002243','SDB','SC-ICBC','ICBC-SC',
			                'SZCHINABANK','AP0015787','FJXYYH','ZSBANK','ZSYHXYK','ZXLMXYK',
			                'CITICBANK','BAIJIN-CB','CB-BILL'];
			   cnVal['13']=['GZMD-011','MOTO-MIDC','MOTOROLA','SAMSUNG','DIANXUN','SCDX',
			                 'CHINAUNICOM','WTJLB'];
			   cnVal['14']=['SH99READER','APJOYOGBK','AP-4213150','AP-4209265','GUIYOU',
			               'JLX','GDH','LZQCJLB','AP-4054180','MLSC','ZHIMAIDAO','AP0001287'];
			   cnVal['15']=['DFHK','AP0011636','HNHK','JXHK','SHHK','SCHK','XMHK"'];
			   cnVal['16']=['ZSHS','E-MEISHI','QQXLMK','ANGELGAO','VIALIFE','QQHY',
			                'HZMD-002','ANJFL','BJTKJ','AP-4053930','AP-4054019',
			                'SZMD-036','HP-CARD','AP-4054110','JZH','AP-4054795',
			                'LWBB','APLHW','LGZY','LBWH','NFJJ','NJJY','PALADIN',
			                'QXGLM','AP0001629','QJWB','AP-4053735','JDWH','SDWL',
			                'TKBAOXIAN','TFZB','NJDL-923','4054569','SOGO-WH','XMDJ',
			                'YTQ','YTZJC','YZWB','YHZC','YLSW','SINOPEC','ZHAN',
			                'ZGBFJY','AGGJHY','ZGLYW','ZGWZR','AP0001316','SZDL-2152',
			                '4053440','AP-ZBZGW'];
			   cnVal['17']=['AP0015620','AP0027074'];

			
			
			var cnText=new Array();
			   cnText['11']=['中油首汽加油卡'];
			   cnText['12']=['工行艺龙联名信用卡','光大银行信用卡','广东发展银行信用卡','华夏银行信用卡',
			                 '建国60周年银联标准主题信用卡','建设银行乐当家','建设银行龙卡信用卡','建行艺龙畅行龙卡联名信用卡',
			                 '交通银行信用卡','民生银行信用卡','宁波市商业银行','宁波银行信用卡','平安银行信用卡',
			                 '浦发银行信用卡','上海银行信用卡','深圳发展银行信用卡','四川工行促销','四川牡丹艺龙商旅信用卡',
			                 '苏州中国银行','兴业-艺龙联名信用卡','兴业银行信用卡','招商银行卡','招商银行信用卡',
			                 '中信艺龙联名卡','中信银行信用卡','中银白金信用卡','中银信用卡'];
			   cnText['13']=['丽江移动全球通会员卡','摩托罗拉E6贵宾联名卡','摩托罗拉俱乐部会员-e龙联名卡',
			                 '三星俱乐部会员-e龙联名卡','上海点讯-e龙联名卡','四川电信-e龙联名卡',
			                 '中国联通客户俱乐部会员-e龙联名卡','中国网通金色俱乐部会员卡'];
			   cnText['14']=['99读书人-e龙联名卡','JOYO-艺龙贵宾联名卡','地产中国网-e龙联名卡','高尔夫平台-e龙联名卡',
			                 '贵友大厦会员卡','金陆翔','乐购网-e龙联名卡','联众汽车俱乐部-e龙联名卡','龙江二手车网-e龙联名卡',
			                 '苏州美罗商城','智买道-e龙联名卡','中油首汽加油卡'];
			   cnText['15']=['东方航空万里行俱乐部会员卡','凤凰知音卡','海南航空金鹏俱乐部会员卡',
			                 '吉祥航空福卡','上海航空金鹤俱乐部','四川航空金熊猫卡','厦门航空促销'];
			   cnText['16']=['ABIS-e龙联名卡','e美食','QQ秀联名卡-e龙联名卡','QQ-艺龙旅行贵宾联名卡',
			                 'VIA LIFE-e龙联名卡','VIPQQ-艺龙旅行贵宾联名卡','阿里巴巴--e龙联名卡',
			                 '安吉捷飞络','佰嘉通（北京）科技有限公司','大学生竞技文化联盟-e龙联名卡',
			                 '海宁同城网-e龙联名卡','花样会e龙联名卡','惠普-艺龙贵宾联名卡',
			                 '济南都市生活网-e龙联名卡','精置会-e龙联名卡','溧阳资讯-e龙联名卡',
			                 '六味巴巴科技有限公司-e龙联名卡','龙虎-e龙联名卡','泸州市港龙置业有限公司',
			                 '旅客报','南方基金-e龙联名卡','南京金鹰','帕拉丁-e龙联名卡','栖息谷-e龙联名卡',
			                 '千橡-e龙企业联名卡','钱江晚报','商务网-e龙联名卡','上海铁道','盛大网络-e龙联名卡',
			                 '泰康-e龙联名卡','天府早报','万事一卡通-e龙联名卡','我问网-e龙联名卡','武汉SOGO崇光百货',
			                 '厦门点击科技-e龙联名卡','烟台圈-e龙联名卡','烟台自驾车-e龙联名卡','扬子晚报广告促销','一嗨租车',
			                 '茵莱商务网-e龙联名卡','油中感谢','中安网-e龙联名卡','中国北方金银业-e龙联名卡',
			                 '中国国际海运网-e龙联名卡','中国旅游网-e龙联名卡','中国温州人-e龙联名卡','中国邮政-河南',
			                 '中海会商旅服务','中华教育资讯网-e龙联名卡','走遍中国网-e龙联名卡'];
			   cnText['17']=['7天会员卡','QQ电脑管家—艺龙联名卡'];